MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/dma_chan00.h
/*
 * Component description for DMA_CHAN00
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2020-03-24T11:15:30Z */
#ifndef _0525SG12_DMA_CHAN00_COMPONENT_H_
#define _0525SG12_DMA_CHAN00_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DMA_CHAN00                                   */
/* ************************************************************************** */

/* -------- DMA_CHAN00_ACTIVATE : (DMA_CHAN00 Offset: 0x00) (R/W 8) Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational. -------- */
#define DMA_CHAN00_ACTIVATE_RESETVALUE        _UINT8_(0x00)                                        /*  (DMA_CHAN00_ACTIVATE) Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational.  Reset Value */

#define DMA_CHAN00_ACTIVATE_CHN_Pos           _UINT8_(0)                                           /* (DMA_CHAN00_ACTIVATE) Enable this channel for operation. The DMA Main Control:Activate must also be enabled for this channel to be operational.\n                  1=Enable channel(block). Each individual channel must be enabled separately.\n                  0=Disable channel(block). Position */
#define DMA_CHAN00_ACTIVATE_CHN_Msk           (_UINT8_(0x1) << DMA_CHAN00_ACTIVATE_CHN_Pos)        /* (DMA_CHAN00_ACTIVATE) Enable this channel for operation. The DMA Main Control:Activate must also be enabled for this channel to be operational.\n                  1=Enable channel(block). Each individual channel must be enabled separately.\n                  0=Disable channel(block). Mask */
#define DMA_CHAN00_ACTIVATE_CHN(value)        (DMA_CHAN00_ACTIVATE_CHN_Msk & (_UINT8_(value) << DMA_CHAN00_ACTIVATE_CHN_Pos)) /* Assigment of value for CHN in the DMA_CHAN00_ACTIVATE register */
#define DMA_CHAN00_ACTIVATE_Msk               _UINT8_(0x01)                                        /* (DMA_CHAN00_ACTIVATE) Register Mask  */


/* -------- DMA_CHAN00_MSTART : (DMA_CHAN00 Offset: 0x04) (R/W 32) This is the starting address for the Memory device. -------- */
#define DMA_CHAN00_MSTART_RESETVALUE          _UINT32_(0x00)                                       /*  (DMA_CHAN00_MSTART) This is the starting address for the Memory device.  Reset Value */

#define DMA_CHAN00_MSTART_Msk                 _UINT32_(0x00000000)                                 /* (DMA_CHAN00_MSTART) Register Mask  */


/* -------- DMA_CHAN00_MEND : (DMA_CHAN00 Offset: 0x08) (R/W 32) This is the ending address for the Memory device. -------- */
#define DMA_CHAN00_MEND_RESETVALUE            _UINT32_(0x00)                                       /*  (DMA_CHAN00_MEND) This is the ending address for the Memory device.  Reset Value */

#define DMA_CHAN00_MEND_Msk                   _UINT32_(0x00000000)                                 /* (DMA_CHAN00_MEND) Register Mask  */


/* -------- DMA_CHAN00_DSTART : (DMA_CHAN00 Offset: 0x0C) (R/W 32) This is the Master Device address. -------- */
#define DMA_CHAN00_DSTART_RESETVALUE          _UINT32_(0x00)                                       /*  (DMA_CHAN00_DSTART) This is the Master Device address.  Reset Value */

#define DMA_CHAN00_DSTART_Msk                 _UINT32_(0x00000000)                                 /* (DMA_CHAN00_DSTART) Register Mask  */


/* -------- DMA_CHAN00_CTRL : (DMA_CHAN00 Offset: 0x10) (R/W 32) DMA Channel N Control -------- */
#define DMA_CHAN00_CTRL_RESETVALUE            _UINT32_(0x00)                                       /*  (DMA_CHAN00_CTRL) DMA Channel N Control  Reset Value */

#define DMA_CHAN00_CTRL_RUN_Pos               _UINT32_(0)                                          /* (DMA_CHAN00_CTRL) This is a control field. Note: This bit only applies to Hardware Flow Control mode.\n                  1= This channel is enabled and will service transfer requests\n                  0=This channel is disabled. All transfer requests are ignored. Position */
#define DMA_CHAN00_CTRL_RUN_Msk               (_UINT32_(0x1) << DMA_CHAN00_CTRL_RUN_Pos)           /* (DMA_CHAN00_CTRL) This is a control field. Note: This bit only applies to Hardware Flow Control mode.\n                  1= This channel is enabled and will service transfer requests\n                  0=This channel is disabled. All transfer requests are ignored. Mask */
#define DMA_CHAN00_CTRL_RUN(value)            (DMA_CHAN00_CTRL_RUN_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_RUN_Pos)) /* Assigment of value for RUN in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_REQ_Pos               _UINT32_(1)                                          /* (DMA_CHAN00_CTRL) This is a status field.\n                  1= There is a transfer request from the Master Device\n                  0= There is no transfer request from the Master Device Position */
#define DMA_CHAN00_CTRL_REQ_Msk               (_UINT32_(0x1) << DMA_CHAN00_CTRL_REQ_Pos)           /* (DMA_CHAN00_CTRL) This is a status field.\n                  1= There is a transfer request from the Master Device\n                  0= There is no transfer request from the Master Device Mask */
#define DMA_CHAN00_CTRL_REQ(value)            (DMA_CHAN00_CTRL_REQ_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_REQ_Pos)) /* Assigment of value for REQ in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_DONE_Pos              _UINT32_(2)                                          /* (DMA_CHAN00_CTRL) This is a status signal. It is only valid while DMA Channel Control: Run is Enabled. \n                  This is the inverse of the DMA Channel Control: Busy field, except this is qualified with the DMA Channel Control:Run field.\n                  1=Channel is done\n                  0=Channel is not done or it is OFF Position */
#define DMA_CHAN00_CTRL_DONE_Msk              (_UINT32_(0x1) << DMA_CHAN00_CTRL_DONE_Pos)          /* (DMA_CHAN00_CTRL) This is a status signal. It is only valid while DMA Channel Control: Run is Enabled. \n                  This is the inverse of the DMA Channel Control: Busy field, except this is qualified with the DMA Channel Control:Run field.\n                  1=Channel is done\n                  0=Channel is not done or it is OFF Mask */
#define DMA_CHAN00_CTRL_DONE(value)           (DMA_CHAN00_CTRL_DONE_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_DONE_Pos)) /* Assigment of value for DONE in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_STS_Pos               _UINT32_(3)                                          /* (DMA_CHAN00_CTRL) This is a status signal. The status decode is listed in priority order with the highest priority first.                  3: Error detected by the DMA                  2: The DMA Channel is externally done, in that the Device has terminated the transfer over the Hardware Flow Control through the Port dma_term                  1: The DMA Channel is locally done, in that Memory Start Address equals Memory End Address                  0: DMA Channel Control:Run is Disabled (0x0) Position */
#define DMA_CHAN00_CTRL_STS_Msk               (_UINT32_(0x3) << DMA_CHAN00_CTRL_STS_Pos)           /* (DMA_CHAN00_CTRL) This is a status signal. The status decode is listed in priority order with the highest priority first.                  3: Error detected by the DMA                  2: The DMA Channel is externally done, in that the Device has terminated the transfer over the Hardware Flow Control through the Port dma_term                  1: The DMA Channel is locally done, in that Memory Start Address equals Memory End Address                  0: DMA Channel Control:Run is Disabled (0x0) Mask */
#define DMA_CHAN00_CTRL_STS(value)            (DMA_CHAN00_CTRL_STS_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_STS_Pos)) /* Assigment of value for STS in the DMA_CHAN00_CTRL register */
#define   DMA_CHAN00_CTRL_STS_ERROR_Val       _UINT32_(0x3)                                        /* (DMA_CHAN00_CTRL) 3: Error detected by the DMA  */
#define   DMA_CHAN00_CTRL_STS_EXT_DONE_Val    _UINT32_(0x2)                                        /* (DMA_CHAN00_CTRL) 2: The DMA Channel is externally done, in that the Device has terminated the transfer over the Hardware Flow Control through the Port dma_term  */
#define   DMA_CHAN00_CTRL_STS_LOC_DONE_Val    _UINT32_(0x1)                                        /* (DMA_CHAN00_CTRL) 1: The DMA Channel is locally done, in that Memory Start Address equals Memory End Address  */
#define   DMA_CHAN00_CTRL_STS_DIS_Val         _UINT32_(0x0)                                        /* (DMA_CHAN00_CTRL) 0: DMA Channel Control:Run is Disabled (0x0)  */
#define DMA_CHAN00_CTRL_STS_ERROR             (DMA_CHAN00_CTRL_STS_ERROR_Val << DMA_CHAN00_CTRL_STS_Pos) /* (DMA_CHAN00_CTRL) 3: Error detected by the DMA Position  */
#define DMA_CHAN00_CTRL_STS_EXT_DONE          (DMA_CHAN00_CTRL_STS_EXT_DONE_Val << DMA_CHAN00_CTRL_STS_Pos) /* (DMA_CHAN00_CTRL) 2: The DMA Channel is externally done, in that the Device has terminated the transfer over the Hardware Flow Control through the Port dma_term Position  */
#define DMA_CHAN00_CTRL_STS_LOC_DONE          (DMA_CHAN00_CTRL_STS_LOC_DONE_Val << DMA_CHAN00_CTRL_STS_Pos) /* (DMA_CHAN00_CTRL) 1: The DMA Channel is locally done, in that Memory Start Address equals Memory End Address Position  */
#define DMA_CHAN00_CTRL_STS_DIS               (DMA_CHAN00_CTRL_STS_DIS_Val << DMA_CHAN00_CTRL_STS_Pos) /* (DMA_CHAN00_CTRL) 0: DMA Channel Control:Run is Disabled (0x0) Position  */
#define DMA_CHAN00_CTRL_BUSY_Pos              _UINT32_(5)                                          /* (DMA_CHAN00_CTRL) This is a status signal.\n                  1=The DMA Channel is busy (FSM is not IDLE)\n                  0=The DMA Channel is not busy (FSM is IDLE) Position */
#define DMA_CHAN00_CTRL_BUSY_Msk              (_UINT32_(0x1) << DMA_CHAN00_CTRL_BUSY_Pos)          /* (DMA_CHAN00_CTRL) This is a status signal.\n                  1=The DMA Channel is busy (FSM is not IDLE)\n                  0=The DMA Channel is not busy (FSM is IDLE) Mask */
#define DMA_CHAN00_CTRL_BUSY(value)           (DMA_CHAN00_CTRL_BUSY_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_BUSY_Pos)) /* Assigment of value for BUSY in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_TX_DIR_Pos            _UINT32_(8)                                          /* (DMA_CHAN00_CTRL) This determines the direction of the DMA Transfer.\n                  1=Data Packet Read from Memory Start Address followed by Data Packet Write to Device Address\n                  0=Data Packet Read from Device Address followed by Data Packet Write to Memory Start Address Position */
#define DMA_CHAN00_CTRL_TX_DIR_Msk            (_UINT32_(0x1) << DMA_CHAN00_CTRL_TX_DIR_Pos)        /* (DMA_CHAN00_CTRL) This determines the direction of the DMA Transfer.\n                  1=Data Packet Read from Memory Start Address followed by Data Packet Write to Device Address\n                  0=Data Packet Read from Device Address followed by Data Packet Write to Memory Start Address Mask */
#define DMA_CHAN00_CTRL_TX_DIR(value)         (DMA_CHAN00_CTRL_TX_DIR_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_TX_DIR_Pos)) /* Assigment of value for TX_DIR in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_HW_FLOW_CTRL_DEV_Pos  _UINT32_(9)                                          /* (DMA_CHAN00_CTRL) This is the device that is connected to this channel as its Hardware Flow Control master.\n                  The Flow Control Interface is a bus with each master concatenated onto it.\n                  This selects which bus index of the concatenated Flow Control Interface bus is targeted towards this channel.\n                  The Flow Control Interface Port list is dma_req, dma_term, and dma_done. Position */
#define DMA_CHAN00_CTRL_HW_FLOW_CTRL_DEV_Msk  (_UINT32_(0x7F) << DMA_CHAN00_CTRL_HW_FLOW_CTRL_DEV_Pos) /* (DMA_CHAN00_CTRL) This is the device that is connected to this channel as its Hardware Flow Control master.\n                  The Flow Control Interface is a bus with each master concatenated onto it.\n                  This selects which bus index of the concatenated Flow Control Interface bus is targeted towards this channel.\n                  The Flow Control Interface Port list is dma_req, dma_term, and dma_done. Mask */
#define DMA_CHAN00_CTRL_HW_FLOW_CTRL_DEV(value) (DMA_CHAN00_CTRL_HW_FLOW_CTRL_DEV_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_HW_FLOW_CTRL_DEV_Pos)) /* Assigment of value for HW_FLOW_CTRL_DEV in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_INC_MEM_ADDR_Pos      _UINT32_(16)                                         /* (DMA_CHAN00_CTRL) This will enable an auto-increment to the DMA Channel Memory Address.\n                  1=Increment the DMA Channel Memory Address by DMA Channel Control:Transfer Size after every Data Packet transfer\n                  0=Do nothing Position */
#define DMA_CHAN00_CTRL_INC_MEM_ADDR_Msk      (_UINT32_(0x1) << DMA_CHAN00_CTRL_INC_MEM_ADDR_Pos)  /* (DMA_CHAN00_CTRL) This will enable an auto-increment to the DMA Channel Memory Address.\n                  1=Increment the DMA Channel Memory Address by DMA Channel Control:Transfer Size after every Data Packet transfer\n                  0=Do nothing Mask */
#define DMA_CHAN00_CTRL_INC_MEM_ADDR(value)   (DMA_CHAN00_CTRL_INC_MEM_ADDR_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_INC_MEM_ADDR_Pos)) /* Assigment of value for INC_MEM_ADDR in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_INC_DEV_ADDR_Pos      _UINT32_(17)                                         /* (DMA_CHAN00_CTRL) This will enable an auto-increment to the DMA Channel Device Address.\n                  1: Increment the DMA Channel Device Address by DMA Channel Control:Transfer Size after every Data Packet transfer\n                  0: Do nothing Position */
#define DMA_CHAN00_CTRL_INC_DEV_ADDR_Msk      (_UINT32_(0x1) << DMA_CHAN00_CTRL_INC_DEV_ADDR_Pos)  /* (DMA_CHAN00_CTRL) This will enable an auto-increment to the DMA Channel Device Address.\n                  1: Increment the DMA Channel Device Address by DMA Channel Control:Transfer Size after every Data Packet transfer\n                  0: Do nothing Mask */
#define DMA_CHAN00_CTRL_INC_DEV_ADDR(value)   (DMA_CHAN00_CTRL_INC_DEV_ADDR_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_INC_DEV_ADDR_Pos)) /* Assigment of value for INC_DEV_ADDR in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_LOCK_Pos              _UINT32_(18)                                         /* (DMA_CHAN00_CTRL) This is used to lock the arbitration of the Channel Arbiter on this channel once this channel is granted. Once this is locked, it will remain on the arbiter until it has completed it transfer (either the Transfer Aborted, Transfer Done or Transfer Terminated conditions). Position */
#define DMA_CHAN00_CTRL_LOCK_Msk              (_UINT32_(0x1) << DMA_CHAN00_CTRL_LOCK_Pos)          /* (DMA_CHAN00_CTRL) This is used to lock the arbitration of the Channel Arbiter on this channel once this channel is granted. Once this is locked, it will remain on the arbiter until it has completed it transfer (either the Transfer Aborted, Transfer Done or Transfer Terminated conditions). Mask */
#define DMA_CHAN00_CTRL_LOCK(value)           (DMA_CHAN00_CTRL_LOCK_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_LOCK_Pos)) /* Assigment of value for LOCK in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_DIS_HW_FLOW_CTRL_Pos  _UINT32_(19)                                         /* (DMA_CHAN00_CTRL) This will Disable the Hardware Flow Control. When disabled, any DMA Master device attempting to communicate to the DMA over the DMA Flow Control Interface (Ports: dma_req, dma_term, and dma_done) will be ignored. This should be set before using the DMA channel in Firmware Flow Control mode. Position */
#define DMA_CHAN00_CTRL_DIS_HW_FLOW_CTRL_Msk  (_UINT32_(0x1) << DMA_CHAN00_CTRL_DIS_HW_FLOW_CTRL_Pos) /* (DMA_CHAN00_CTRL) This will Disable the Hardware Flow Control. When disabled, any DMA Master device attempting to communicate to the DMA over the DMA Flow Control Interface (Ports: dma_req, dma_term, and dma_done) will be ignored. This should be set before using the DMA channel in Firmware Flow Control mode. Mask */
#define DMA_CHAN00_CTRL_DIS_HW_FLOW_CTRL(value) (DMA_CHAN00_CTRL_DIS_HW_FLOW_CTRL_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_DIS_HW_FLOW_CTRL_Pos)) /* Assigment of value for DIS_HW_FLOW_CTRL in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_TRANS_SIZE_Pos        _UINT32_(20)                                         /* (DMA_CHAN00_CTRL) This is the transfer size in Bytes of each Data Packet transfer.\n                  Note: The transfer size must be a legal AMBA transfer size. Valid sizes are 1, 2 and 4 Bytes. Position */
#define DMA_CHAN00_CTRL_TRANS_SIZE_Msk        (_UINT32_(0x7) << DMA_CHAN00_CTRL_TRANS_SIZE_Pos)    /* (DMA_CHAN00_CTRL) This is the transfer size in Bytes of each Data Packet transfer.\n                  Note: The transfer size must be a legal AMBA transfer size. Valid sizes are 1, 2 and 4 Bytes. Mask */
#define DMA_CHAN00_CTRL_TRANS_SIZE(value)     (DMA_CHAN00_CTRL_TRANS_SIZE_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_TRANS_SIZE_Pos)) /* Assigment of value for TRANS_SIZE in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_TRANS_GO_Pos          _UINT32_(24)                                         /* (DMA_CHAN00_CTRL) This is used for the Firmware Flow Control DMA transfer. Position */
#define DMA_CHAN00_CTRL_TRANS_GO_Msk          (_UINT32_(0x1) << DMA_CHAN00_CTRL_TRANS_GO_Pos)      /* (DMA_CHAN00_CTRL) This is used for the Firmware Flow Control DMA transfer. Mask */
#define DMA_CHAN00_CTRL_TRANS_GO(value)       (DMA_CHAN00_CTRL_TRANS_GO_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_TRANS_GO_Pos)) /* Assigment of value for TRANS_GO in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_TRANS_ABORT_Pos       _UINT32_(25)                                         /* (DMA_CHAN00_CTRL) This is used to abort the current transfer on this DMA Channel. The aborted transfer will be forced to terminate immediately. Position */
#define DMA_CHAN00_CTRL_TRANS_ABORT_Msk       (_UINT32_(0x1) << DMA_CHAN00_CTRL_TRANS_ABORT_Pos)   /* (DMA_CHAN00_CTRL) This is used to abort the current transfer on this DMA Channel. The aborted transfer will be forced to terminate immediately. Mask */
#define DMA_CHAN00_CTRL_TRANS_ABORT(value)    (DMA_CHAN00_CTRL_TRANS_ABORT_Msk & (_UINT32_(value) << DMA_CHAN00_CTRL_TRANS_ABORT_Pos)) /* Assigment of value for TRANS_ABORT in the DMA_CHAN00_CTRL register */
#define DMA_CHAN00_CTRL_Msk                   _UINT32_(0x037FFF3F)                                 /* (DMA_CHAN00_CTRL) Register Mask  */


/* -------- DMA_CHAN00_ISTS : (DMA_CHAN00 Offset: 0x14) (R/W 8) DMA Channel N Interrupt Status -------- */
#define DMA_CHAN00_ISTS_RESETVALUE            _UINT8_(0x00)                                        /*  (DMA_CHAN00_ISTS) DMA Channel N Interrupt Status  Reset Value */

#define DMA_CHAN00_ISTS_BUS_ERR_Pos           _UINT8_(0)                                           /* (DMA_CHAN00_ISTS) This is an interrupt source register. This flags when there is an Error detected over the internal 32-bit Bus.\n                  1: Error detected. (R/WC) Position */
#define DMA_CHAN00_ISTS_BUS_ERR_Msk           (_UINT8_(0x1) << DMA_CHAN00_ISTS_BUS_ERR_Pos)        /* (DMA_CHAN00_ISTS) This is an interrupt source register. This flags when there is an Error detected over the internal 32-bit Bus.\n                  1: Error detected. (R/WC) Mask */
#define DMA_CHAN00_ISTS_BUS_ERR(value)        (DMA_CHAN00_ISTS_BUS_ERR_Msk & (_UINT8_(value) << DMA_CHAN00_ISTS_BUS_ERR_Pos)) /* Assigment of value for BUS_ERR in the DMA_CHAN00_ISTS register */
#define DMA_CHAN00_ISTS_FLOW_CTRL_Pos         _UINT8_(1)                                           /* (DMA_CHAN00_ISTS) This is an interrupt source register. This flags when the DMA Channel has encountered a Hardware Flow Control Request\n     after the DMA Channel has completed the transfer. This means the Master Device is attempting to overflow the DMA.\n                  1=Hardware Flow Control is requesting after the transfer has completed\n                  0=No Hardware Flow Control event Position */
#define DMA_CHAN00_ISTS_FLOW_CTRL_Msk         (_UINT8_(0x1) << DMA_CHAN00_ISTS_FLOW_CTRL_Pos)      /* (DMA_CHAN00_ISTS) This is an interrupt source register. This flags when the DMA Channel has encountered a Hardware Flow Control Request\n     after the DMA Channel has completed the transfer. This means the Master Device is attempting to overflow the DMA.\n                  1=Hardware Flow Control is requesting after the transfer has completed\n                  0=No Hardware Flow Control event Mask */
#define DMA_CHAN00_ISTS_FLOW_CTRL(value)      (DMA_CHAN00_ISTS_FLOW_CTRL_Msk & (_UINT8_(value) << DMA_CHAN00_ISTS_FLOW_CTRL_Pos)) /* Assigment of value for FLOW_CTRL in the DMA_CHAN00_ISTS register */
#define DMA_CHAN00_ISTS_DONE_Pos              _UINT8_(2)                                           /* (DMA_CHAN00_ISTS) This is an interrupt source register. This flags when the DMA Channel has completed a transfer successfully on its side.\n     A completed transfer is defined as when the DMA Channel reaches its limit; Memory Start Address equals Memory End Address.\n     A completion due to a Hardware Flow Control Terminate will not flag this interrupt.\n                  1=Memory Start Address equals Memory End Address\n                  0=Memory Start Address does not equal Memory End Address Position */
#define DMA_CHAN00_ISTS_DONE_Msk              (_UINT8_(0x1) << DMA_CHAN00_ISTS_DONE_Pos)           /* (DMA_CHAN00_ISTS) This is an interrupt source register. This flags when the DMA Channel has completed a transfer successfully on its side.\n     A completed transfer is defined as when the DMA Channel reaches its limit; Memory Start Address equals Memory End Address.\n     A completion due to a Hardware Flow Control Terminate will not flag this interrupt.\n                  1=Memory Start Address equals Memory End Address\n                  0=Memory Start Address does not equal Memory End Address Mask */
#define DMA_CHAN00_ISTS_DONE(value)           (DMA_CHAN00_ISTS_DONE_Msk & (_UINT8_(value) << DMA_CHAN00_ISTS_DONE_Pos)) /* Assigment of value for DONE in the DMA_CHAN00_ISTS register */
#define DMA_CHAN00_ISTS_Msk                   _UINT8_(0x07)                                        /* (DMA_CHAN00_ISTS) Register Mask  */


/* -------- DMA_CHAN00_IEN : (DMA_CHAN00 Offset: 0x18) (R/W 8) DMA CHANNEL N INTERRUPT ENABLE -------- */
#define DMA_CHAN00_IEN_RESETVALUE             _UINT8_(0x00)                                        /*  (DMA_CHAN00_IEN) DMA CHANNEL N INTERRUPT ENABLE  Reset Value */

