MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/dma_chan00.h
#define DMA_CHAN00_IEN_STS_EN_BUS_ERR_Pos     _UINT8_(0)                                           /* (DMA_CHAN00_IEN) This is an interrupt enable for DMA Channel Interrupt:Status Bus Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Position */
#define DMA_CHAN00_IEN_STS_EN_BUS_ERR_Msk     (_UINT8_(0x1) << DMA_CHAN00_IEN_STS_EN_BUS_ERR_Pos)  /* (DMA_CHAN00_IEN) This is an interrupt enable for DMA Channel Interrupt:Status Bus Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Mask */
#define DMA_CHAN00_IEN_STS_EN_BUS_ERR(value)  (DMA_CHAN00_IEN_STS_EN_BUS_ERR_Msk & (_UINT8_(value) << DMA_CHAN00_IEN_STS_EN_BUS_ERR_Pos)) /* Assigment of value for STS_EN_BUS_ERR in the DMA_CHAN00_IEN register */
#define DMA_CHAN00_IEN_STS_EN_FLOW_CTRL_Pos   _UINT8_(1)                                           /* (DMA_CHAN00_IEN) This is an interrupt enable for DMA Channel Interrupt:Status Flow Control Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Position */
#define DMA_CHAN00_IEN_STS_EN_FLOW_CTRL_Msk   (_UINT8_(0x1) << DMA_CHAN00_IEN_STS_EN_FLOW_CTRL_Pos) /* (DMA_CHAN00_IEN) This is an interrupt enable for DMA Channel Interrupt:Status Flow Control Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Mask */
#define DMA_CHAN00_IEN_STS_EN_FLOW_CTRL(value) (DMA_CHAN00_IEN_STS_EN_FLOW_CTRL_Msk & (_UINT8_(value) << DMA_CHAN00_IEN_STS_EN_FLOW_CTRL_Pos)) /* Assigment of value for STS_EN_FLOW_CTRL in the DMA_CHAN00_IEN register */
#define DMA_CHAN00_IEN_STS_EN_DONE_Pos        _UINT8_(2)                                           /* (DMA_CHAN00_IEN) This is an interrupt enable for DMA Channel Interrupt:Status Done.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Position */
#define DMA_CHAN00_IEN_STS_EN_DONE_Msk        (_UINT8_(0x1) << DMA_CHAN00_IEN_STS_EN_DONE_Pos)     /* (DMA_CHAN00_IEN) This is an interrupt enable for DMA Channel Interrupt:Status Done.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Mask */
#define DMA_CHAN00_IEN_STS_EN_DONE(value)     (DMA_CHAN00_IEN_STS_EN_DONE_Msk & (_UINT8_(value) << DMA_CHAN00_IEN_STS_EN_DONE_Pos)) /* Assigment of value for STS_EN_DONE in the DMA_CHAN00_IEN register */
#define DMA_CHAN00_IEN_Msk                    _UINT8_(0x07)                                        /* (DMA_CHAN00_IEN) Register Mask  */


/* -------- DMA_CHAN00_CRC_EN : (DMA_CHAN00 Offset: 0x20) (R/W 32) DMA CHANNEL N CRC ENABLE -------- */
#define DMA_CHAN00_CRC_EN_RESETVALUE          _UINT32_(0x00)                                       /*  (DMA_CHAN00_CRC_EN) DMA CHANNEL N CRC ENABLE  Reset Value */

#define DMA_CHAN00_CRC_EN_MODE_Pos            _UINT32_(0)                                          /* (DMA_CHAN00_CRC_EN) 1=Enable the calculation of CRC-32 for DMA Channel N\n     0=Disable the calculation of CRC-32 for DMA Channel N Position */
#define DMA_CHAN00_CRC_EN_MODE_Msk            (_UINT32_(0x1) << DMA_CHAN00_CRC_EN_MODE_Pos)        /* (DMA_CHAN00_CRC_EN) 1=Enable the calculation of CRC-32 for DMA Channel N\n     0=Disable the calculation of CRC-32 for DMA Channel N Mask */
#define DMA_CHAN00_CRC_EN_MODE(value)         (DMA_CHAN00_CRC_EN_MODE_Msk & (_UINT32_(value) << DMA_CHAN00_CRC_EN_MODE_Pos)) /* Assigment of value for MODE in the DMA_CHAN00_CRC_EN register */
#define DMA_CHAN00_CRC_EN_POST_TRANS_Pos      _UINT32_(1)                                          /* (DMA_CHAN00_CRC_EN) The bit enables the transfer of the calculated CRC-32 after the completion of the DMA transaction.\n     If the DMA transaction is aborted by either firmware or an internal bus error, the transfer will not occur.\n     If the target of the DMA transfer is a device and the device signaled the termination of the DMA transaction,\n     the CRC post transfer will not occur.\n     1=Enable the transfer of CRC-32 for DMA Channel N after the DMA transaction completes\n     0=Disable the automatic transfer of the CRC Position */
#define DMA_CHAN00_CRC_EN_POST_TRANS_Msk      (_UINT32_(0x1) << DMA_CHAN00_CRC_EN_POST_TRANS_Pos)  /* (DMA_CHAN00_CRC_EN) The bit enables the transfer of the calculated CRC-32 after the completion of the DMA transaction.\n     If the DMA transaction is aborted by either firmware or an internal bus error, the transfer will not occur.\n     If the target of the DMA transfer is a device and the device signaled the termination of the DMA transaction,\n     the CRC post transfer will not occur.\n     1=Enable the transfer of CRC-32 for DMA Channel N after the DMA transaction completes\n     0=Disable the automatic transfer of the CRC Mask */
#define DMA_CHAN00_CRC_EN_POST_TRANS(value)   (DMA_CHAN00_CRC_EN_POST_TRANS_Msk & (_UINT32_(value) << DMA_CHAN00_CRC_EN_POST_TRANS_Pos)) /* Assigment of value for POST_TRANS in the DMA_CHAN00_CRC_EN register */
#define DMA_CHAN00_CRC_EN_Msk                 _UINT32_(0x00000003)                                 /* (DMA_CHAN00_CRC_EN) Register Mask  */


/* -------- DMA_CHAN00_CRC_DATA : (DMA_CHAN00 Offset: 0x24) (R/W 32) DMA CHANNEL N CRC DATA -------- */
#define DMA_CHAN00_CRC_DATA_RESETVALUE        _UINT32_(0x00)                                       /*  (DMA_CHAN00_CRC_DATA) DMA CHANNEL N CRC DATA  Reset Value */

#define DMA_CHAN00_CRC_DATA_CRC_Pos           _UINT32_(0)                                          /* (DMA_CHAN00_CRC_DATA) Writes to this register initialize the CRC generator. Reads from this register return the output of the\n     CRC that is calculated from the data transferred by DMA Channel N. The output of the CRC generator is bit-reversed\n     and inverted on reads, as required by the CRC-32-IEEE definition. A CRC can be accumulated across multiple DMA transactions\n     on Channel N. If it is necessary to save the intermediate CRC value, the result of the read of this register must be\n     bit-reversed and inverted before being written back to this register. Position */
#define DMA_CHAN00_CRC_DATA_CRC_Msk           (_UINT32_(0xFFFFFFFF) << DMA_CHAN00_CRC_DATA_CRC_Pos) /* (DMA_CHAN00_CRC_DATA) Writes to this register initialize the CRC generator. Reads from this register return the output of the\n     CRC that is calculated from the data transferred by DMA Channel N. The output of the CRC generator is bit-reversed\n     and inverted on reads, as required by the CRC-32-IEEE definition. A CRC can be accumulated across multiple DMA transactions\n     on Channel N. If it is necessary to save the intermediate CRC value, the result of the read of this register must be\n     bit-reversed and inverted before being written back to this register. Mask */
#define DMA_CHAN00_CRC_DATA_CRC(value)        (DMA_CHAN00_CRC_DATA_CRC_Msk & (_UINT32_(value) << DMA_CHAN00_CRC_DATA_CRC_Pos)) /* Assigment of value for CRC in the DMA_CHAN00_CRC_DATA register */
#define DMA_CHAN00_CRC_DATA_Msk               _UINT32_(0xFFFFFFFF)                                 /* (DMA_CHAN00_CRC_DATA) Register Mask  */


/* -------- DMA_CHAN00_CRC_POST_STS : (DMA_CHAN00 Offset: 0x28) (R/W 32) DMA CHANNEL N CRC POST STATUS -------- */
#define DMA_CHAN00_CRC_POST_STS_RESETVALUE    _UINT32_(0x00)                                       /*  (DMA_CHAN00_CRC_POST_STS) DMA CHANNEL N CRC POST STATUS  Reset Value */

#define DMA_CHAN00_CRC_POST_STS_CRC_DONE_Pos  _UINT32_(0)                                          /* (DMA_CHAN00_CRC_POST_STS) This bit is set to '1b' when the CRC calculation has completed from either normal or forced termination.\n     It is cleared to '0b' when the DMA controller starts a new transfer on the channel. Position */
#define DMA_CHAN00_CRC_POST_STS_CRC_DONE_Msk  (_UINT32_(0x1) << DMA_CHAN00_CRC_POST_STS_CRC_DONE_Pos) /* (DMA_CHAN00_CRC_POST_STS) This bit is set to '1b' when the CRC calculation has completed from either normal or forced termination.\n     It is cleared to '0b' when the DMA controller starts a new transfer on the channel. Mask */
#define DMA_CHAN00_CRC_POST_STS_CRC_DONE(value) (DMA_CHAN00_CRC_POST_STS_CRC_DONE_Msk & (_UINT32_(value) << DMA_CHAN00_CRC_POST_STS_CRC_DONE_Pos)) /* Assigment of value for CRC_DONE in the DMA_CHAN00_CRC_POST_STS register */
#define DMA_CHAN00_CRC_POST_STS_CRC_RUNNING_Pos _UINT32_(1)                                          /* (DMA_CHAN00_CRC_POST_STS) This bit is set to '1b' when the DMA controller starts the post-transfer transmission of the CRC.\n     It is only set when the post-transfer is enabled by the CRC_POST_TRANSFER_ENABLE field. This bit is cleared\n     to '0b' when the post-transfer completes. Position */
#define DMA_CHAN00_CRC_POST_STS_CRC_RUNNING_Msk (_UINT32_(0x1) << DMA_CHAN00_CRC_POST_STS_CRC_RUNNING_Pos) /* (DMA_CHAN00_CRC_POST_STS) This bit is set to '1b' when the DMA controller starts the post-transfer transmission of the CRC.\n     It is only set when the post-transfer is enabled by the CRC_POST_TRANSFER_ENABLE field. This bit is cleared\n     to '0b' when the post-transfer completes. Mask */
#define DMA_CHAN00_CRC_POST_STS_CRC_RUNNING(value) (DMA_CHAN00_CRC_POST_STS_CRC_RUNNING_Msk & (_UINT32_(value) << DMA_CHAN00_CRC_POST_STS_CRC_RUNNING_Pos)) /* Assigment of value for CRC_RUNNING in the DMA_CHAN00_CRC_POST_STS register */
#define DMA_CHAN00_CRC_POST_STS_CRC_DATA_DONE_Pos _UINT32_(2)                                          /* (DMA_CHAN00_CRC_POST_STS) This bit is set to '1b' when the DMA controller has completed the post-transfer of the CRC data.\n     This bit is cleared to '0b' when the a new DMA transfer starts. Position */
#define DMA_CHAN00_CRC_POST_STS_CRC_DATA_DONE_Msk (_UINT32_(0x1) << DMA_CHAN00_CRC_POST_STS_CRC_DATA_DONE_Pos) /* (DMA_CHAN00_CRC_POST_STS) This bit is set to '1b' when the DMA controller has completed the post-transfer of the CRC data.\n     This bit is cleared to '0b' when the a new DMA transfer starts. Mask */
#define DMA_CHAN00_CRC_POST_STS_CRC_DATA_DONE(value) (DMA_CHAN00_CRC_POST_STS_CRC_DATA_DONE_Msk & (_UINT32_(value) << DMA_CHAN00_CRC_POST_STS_CRC_DATA_DONE_Pos)) /* Assigment of value for CRC_DATA_DONE in the DMA_CHAN00_CRC_POST_STS register */
#define DMA_CHAN00_CRC_POST_STS_CRC_DATA_READY_Pos _UINT32_(3)                                          /* (DMA_CHAN00_CRC_POST_STS) This bit is set to '1b' when the DMA controller is processing the post-transfer of the CRC data.\n     This bit is cleared to '0b' when the post-transfer completes. Position */
#define DMA_CHAN00_CRC_POST_STS_CRC_DATA_READY_Msk (_UINT32_(0x1) << DMA_CHAN00_CRC_POST_STS_CRC_DATA_READY_Pos) /* (DMA_CHAN00_CRC_POST_STS) This bit is set to '1b' when the DMA controller is processing the post-transfer of the CRC data.\n     This bit is cleared to '0b' when the post-transfer completes. Mask */
#define DMA_CHAN00_CRC_POST_STS_CRC_DATA_READY(value) (DMA_CHAN00_CRC_POST_STS_CRC_DATA_READY_Msk & (_UINT32_(value) << DMA_CHAN00_CRC_POST_STS_CRC_DATA_READY_Pos)) /* Assigment of value for CRC_DATA_READY in the DMA_CHAN00_CRC_POST_STS register */
#define DMA_CHAN00_CRC_POST_STS_Msk           _UINT32_(0x0000000F)                                 /* (DMA_CHAN00_CRC_POST_STS) Register Mask  */


