MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/dma_chan00.h
/** \brief DMA_CHAN00 register offsets definitions */
#define DMA_CHAN00_ACTIVATE_REG_OFST   _UINT32_(0x00)      /* (DMA_CHAN00_ACTIVATE) Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational. Offset */
#define DMA_CHAN00_MSTART_REG_OFST     _UINT32_(0x04)      /* (DMA_CHAN00_MSTART) This is the starting address for the Memory device. Offset */
#define DMA_CHAN00_MEND_REG_OFST       _UINT32_(0x08)      /* (DMA_CHAN00_MEND) This is the ending address for the Memory device. Offset */
#define DMA_CHAN00_DSTART_REG_OFST     _UINT32_(0x0C)      /* (DMA_CHAN00_DSTART) This is the Master Device address. Offset */
#define DMA_CHAN00_CTRL_REG_OFST       _UINT32_(0x10)      /* (DMA_CHAN00_CTRL) DMA Channel N Control Offset */
#define DMA_CHAN00_ISTS_REG_OFST       _UINT32_(0x14)      /* (DMA_CHAN00_ISTS) DMA Channel N Interrupt Status Offset */
#define DMA_CHAN00_IEN_REG_OFST        _UINT32_(0x18)      /* (DMA_CHAN00_IEN) DMA CHANNEL N INTERRUPT ENABLE Offset */
#define DMA_CHAN00_CRC_EN_REG_OFST     _UINT32_(0x20)      /* (DMA_CHAN00_CRC_EN) DMA CHANNEL N CRC ENABLE Offset */
#define DMA_CHAN00_CRC_DATA_REG_OFST   _UINT32_(0x24)      /* (DMA_CHAN00_CRC_DATA) DMA CHANNEL N CRC DATA Offset */
#define DMA_CHAN00_CRC_POST_STS_REG_OFST _UINT32_(0x28)      /* (DMA_CHAN00_CRC_POST_STS) DMA CHANNEL N CRC POST STATUS Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DMA_CHAN00 register API structure */
typedef struct
{  /* DMA Channel 00 Registers */
  __IO  uint8_t                        DMA_CHAN00_ACTIVATE; /**< Offset: 0x00 (R/W  8) Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational. */
  __I   uint8_t                        Reserved1[0x03];
  __IO  uint32_t                       DMA_CHAN00_MSTART;  /**< Offset: 0x04 (R/W  32) This is the starting address for the Memory device. */
  __IO  uint32_t                       DMA_CHAN00_MEND;    /**< Offset: 0x08 (R/W  32) This is the ending address for the Memory device. */
  __IO  uint32_t                       DMA_CHAN00_DSTART;  /**< Offset: 0x0C (R/W  32) This is the Master Device address. */
  __IO  uint32_t                       DMA_CHAN00_CTRL;    /**< Offset: 0x10 (R/W  32) DMA Channel N Control */
  __IO  uint8_t                        DMA_CHAN00_ISTS;    /**< Offset: 0x14 (R/W  8) DMA Channel N Interrupt Status */
  __I   uint8_t                        Reserved2[0x03];
  __IO  uint8_t                        DMA_CHAN00_IEN;     /**< Offset: 0x18 (R/W  8) DMA CHANNEL N INTERRUPT ENABLE */
  __I   uint8_t                        Reserved3[0x07];
  __IO  uint32_t                       DMA_CHAN00_CRC_EN;  /**< Offset: 0x20 (R/W  32) DMA CHANNEL N CRC ENABLE */
  __IO  uint32_t                       DMA_CHAN00_CRC_DATA; /**< Offset: 0x24 (R/W  32) DMA CHANNEL N CRC DATA */
  __IO  uint32_t                       DMA_CHAN00_CRC_POST_STS; /**< Offset: 0x28 (R/W  32) DMA CHANNEL N CRC POST STATUS */
} dma_chan00_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _0525SG12_DMA_CHAN00_COMPONENT_H_ */
